app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("description", "etc", "image_url", "price", "title") VALUES (?, ?, ?, ?, ?)  [["description", "ruby_des"], ["etc", "ruby is so hard"], ["image_url", "ruby.jpg"], ["price", 20000], ["title", "ruby"]]

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "price" = ? WHERE "products"."id" = 1  [["price", 21000]]